/**********************************************************************************************/
/*! @file   SceneUtility.cs
*********************************************************************************************
@brief      シーン系の便利クラスをまとめたファイル
*********************************************************************************************
@author     Ko Hashimoto
***************************************************************************************
* Copyright © 2016 Ko Hashimoto All Rights Reserved.
**********************************************************************************************/

using UnityEngine;

/******************************************************************************* 
    @brief   シーン用のテーブルクラス
*/
[System.Serializable]
public class SceneTable : TTableBase<EScene, GameObject,ScenePair>
{
}

/******************************************************************************* 
    @brief   シーン用のペアクラス
*/
[System.Serializable]
public class ScenePair : TPair<EScene, GameObject>
{
    public ScenePair(EScene key, GameObject value) : base(key, value)
    {
    }
}