/**********************************************************************************************/
/*! @file   BaseObjectExtension.cs
*********************************************************************************************
@brief      BaseObjectExtension型に対しての拡張メソッドをまとめたファイル
*********************************************************************************************
@author     Ko Hashimoto
***************************************************************************************
* Copyright © 2016 Ko Hashimoto All Rights Reserved.
**********************************************************************************************/
using UnityEngine;
using System.Collections;

/**************************************************************************************
@brief  BaseObject型に対しての拡張メソッドをまとめた静的クラス
*/
public static class BaseObjectExtension{
    /**************************************************************************************
    @brief        オブジェクトが存在するかの判定
    @return       存在する：true/存在しない：false
    */
    public static bool IsValid(this BaseObject target)
    {
        return (target != null) ? true : false;

    }
}
