/**************************************************************************************/
/*! @file   ECourseType.cs
***************************************************************************************
@brief      コースボタンに関する列挙体
***************************************************************************************
@author     Ryo Sugiyama
***************************************************************************************
* Copyright © 2016 RyoSugiyama All Rights Reserved.
***************************************************************************************/
using UnityEngine;
using System.Collections;
using UnityEngine.UI;


public enum ECourseType
{
    straight,
    corner,
    usingItem,
    accelerate,
    none
}