/**************************************************************************************/
/*! @file   ShipStatus.cs
***************************************************************************************
@brief      船のステータスを持つクラス
***************************************************************************************
@author     Kaneko Kazuki
***************************************************************************************/
using UnityEngine;
using System.Collections;

public class ShipStatus : BaseObject {

    /**************************************************************************************
    @brief  船のID
    */
    public int mId
    {
        get; set;
    }

    /**************************************************************************************
    @brief  関連付けされる船のコンポーネント
    */
    public ShipMove mShip
    {
        get; set;
    }


    protected override void mOnRegistered()
    {
        base.mOnRegistered();
        mUnregisterList(this);
    }


}
